groupShtID = '1019432178'
round16ShtID = '2040289477'
advanceShtID = '978495420'
googleshtURL = 'https://docs.google.com/spreadsheets/d/1rg4ZHjbTbQ2qtwRVCUbWjTolqBML0vYSgleMwyUUGBc/edit#gid=1019432178'

flags_mapping = {
    "卡達": "🇶🇦", "厄瓜多": "🇪🇨", "塞內加爾": "🇸🇳", "荷蘭": "🇳🇱",
    "英格蘭": "🏴󠁧󠁢󠁥󠁮󠁧󠁿", "伊朗": "🇮🇷", "美國": "🇺🇸", "威爾斯": "🏴󠁧󠁢󠁷󠁬󠁳󠁿",
    "阿根廷": "🇦🇷", "沙烏地阿拉伯": "🇸🇦", "墨西哥": "🇲🇽", "波蘭": "🇵🇱",
    "法國": "🇫🇷", "丹麥": "🇩🇰", "突尼西亞": "🇹🇳",  "澳洲": "🇦🇺",
    "西班牙": "🇪🇸", "德國": "🇩🇪", "日本": "🇯🇵", "哥斯大黎加": "🇨🇷",
    "比利時": "🇧🇪",  "加拿大": "🇨🇦", "摩洛哥": "🇲🇦", "克羅埃西亞": "🇭🇷",
    "巴西": "🇧🇷", "塞爾維亞": "🇷🇸", "瑞士": "🇨🇭", "喀麥隆": "🇨🇲",
    "葡萄牙": "🇵🇹", "迦納": "🇬🇭", "烏拉圭": "🇺🇾", "南韓": "🇰🇷", }
acceptable_group = ["A", "B", "C", "D", "E", "F", "G", "H"]
acceptable_round = {"16": 0, "8": 0, "4": 0, "3": 0, "1": 0}
